// ----------------------
// STATIONS
// ----------------------
 window.stations = [
  { name: "大分駅",       lat: 33.23232801877058, lng: 131.6057111319828 },
  { name: "西大分駅",     lat: 33.24522482617123, lng: 131.58285137901504 },
  { name: "東別府駅",     lat: 33.2677076187008,  lng: 131.51050697420135 },
  { name: "別府駅",       lat: 33.27962926018525, lng: 131.50055717746778 },
  { name: "別府大学駅",   lat: 33.31315944403043, lng: 131.49927886577296 },
  { name: "亀川駅",       lat: 33.3312027734460,  lng: 131.493079650432 },

  // KYUDAI MAIN LINE (Ōita → Yufuin)
  { name: "南大分駅",     lat: 33.220745669581504, lng: 131.60752771624055 },
  { name: "古国府駅",     lat: 33.22065690479467, lng: 131.60749091301474 },
  { name: "賀来駅",       lat: 33.21323569734439, lng: 131.5626648657675 },
  { name: "豊後国分駅",   lat: 33.19506346554613, lng: 131.5512154516554 },
  { name: "天神山駅",     lat: 33.186959358136164, lng: 131.43886043693058 },
  { name: "小野屋駅",     lat: 33.18509931488385, lng: 131.4528201313089 },
  { name: "鬼瀬駅",       lat: 33.19563483964115, lng: 131.48543738110843 },
  { name: "南由布駅",     lat: 33.24229580755208, lng: 131.33357602588526 },
  { name: "湯平駅",       lat: 33.1973714290547, lng: 131.35408359460197  },
  { name: "由布院駅",     lat: 33.26269658669704, lng: 131.35526192713755 },

  // NIPPO MAIN LINE (Ōita → Oita Daigaku) 
  { name: "牧駅",   lat: 33.23710163129472,  lng: 131.6377864657687 },
  { name: "高城駅",     lat: 33.242651842215196,  lng: 131.6552683657691 },
  { name: "鶴崎駅",     lat: 33.242743773481486,  lng: 131.68689915412372 },
  { name: "大在駅",       lat: 33.24388399586119,  lng: 131.7203999412276 },
  { name: "坂ノ市駅",     lat: 33.24229580755208, lng: 131.33357602588526 },
  { name: "幸崎駅",       lat: 33.23665381485215,  lng: 131.75160342343978 },
  { name: "大分大学前駅",  lat: 33.17724089366869,  lng: 131.6186053657655 },
  { name: "中判田駅",     lat: 33.16447006646251,  lng: 131.63879511909792 },
  { name: "竹中駅",     lat: 33.12069695808658,  lng: 131.64941536040405 },
   { name: "犬飼駅",     lat: 33.12069695808658,  lng: 131.64941536040405 }
];

// ----------------------
// THERAPY
// ----------------------33.07805272771021, 131.63657468711656
window.therapies = [
  { name: "Studio Pataka", lat: 33.221392, lng: 131.586237 }
];

// ----------------------
// BOOKSTORES
// ----------------------
window.bookstores = [
  { name: "TSUTAYA Mitsuyoshiten", lat: 33.199082, lng: 131.605068 }
];

// ----------------------
// COFFEE SHOPS
// ----------------------
window.coffeeshops = [
  { name: "Starbucks Omichi Oita Bypass", lat: 33.212474, lng: 131.596578 },
  { name: "Starbucks 大分高城店", lat: 33.24404708941849, lng: 131.65350400593104 },
  { name: "Starbucks 下郡", lat: 33.229669803149406, lng: 131.6352234916875 },
  { name: "Starbucks Nakakasuga Oita", lat: 33.23985440134827, lng: 131.59493664576107 },
  { name: "Witch Coffee Stand 中央町 ", lat: 33.23863304641898, lng: 131.607084223584 },
  { name: "Witch Coffee Mare", lat: 33.24802817257983, lng: 131.5833951776591 },
  { name: "Witch Coffee 南大分", lat: 33.21177823071886, lng: 131.5916415244462 }
];

// ----------------------
// ARTISANS
// ----------------------
window.artisans = [
  { name: "Oita Made Shop アカレンガ", lat: 33.237182, lng: 131.60759945195588 }
];

// ----------------------
// NOODLES
// ----------------------
window.noodles = [
  { name: "Ramen Workshop Fukuya", lat: 33.2325999418626, lng: 131.60667938756507 }
];

// ----------------------
// RESTAURANTS
// ----------------------
window.restaurants = [
  { name: "Konas Coffee Minami Oita", lat: 33.208655, lng: 131.599828 }
];

// ----------------------
// SUPERMARKETS
// ----------------------
window.supermarkets = [
  { name: "Melon Supermarket", lat: 33.233223, lng: 131.598352 }
];

// ----------------------
// CLINICS
// ----------------------
window.clinics = [
  // ADD WHEN READY
  // { name: "Hirano 内科", lat: xx.xxxxxx, lng: xxx.xxxxxx }
];

// ----------------------
// CHURCHES
// ----------------------
window.churches = [
  { name: "St. Francis Xavier Cathedral", lat: 33.238665, lng: 131.604509 }
];
