window.stations = [
  { name: "姪浜駅", lat: 33.58370, lng: 130.32501 },
  { name: "下山門駅", lat: 33.581882, lng: 130.308038 },
  { name: "今宿駅", lat: 33.579257, lng: 130.273519 },
  { name: "九大学研都市駅", lat: 33.578150, lng: 130.259861 },
  { name: "周船寺駅", lat: 33.570792, lng: 130.246136 },
  { name: "波多江駅", lat: 33.563944, lng: 130.226822 },
  { name: "糸島高校前駅", lat: 33.560660, lng: 130.213243 },
  { name: "筑前前原駅", lat: 33.557082, lng: 130.199305 },
  { name: "美咲が丘駅", lat: 33.549959, lng: 130.185515 },
  { name: "加布里駅", lat: 33.543150, lng: 130.176150 },
  { name: "一貴山駅", lat: 33.534295, lng: 130.168242 },
  { name: "筑前深江駅", lat: 33.514949, lng: 130.139429 },
  { name: "大入駅", lat: 33.508855, lng: 130.106038 },
  { name: "福吉駅", lat: 33.501554, lng: 130.079523 },
  { name: "鹿家駅", lat: 33.484259, lng: 130.047476 },
  { name: "浜崎駅", lat: 33.447708, lng: 129.983899 },
  { name: "虹の松原駅", lat: 33.441033, lng: 130.016195 },
  { name: "東唐津駅", lat: 33.439393, lng: 129.996837 },
  { name: "和多田駅", lat: 33.436933, lng: 129.980768 },
  { name: "唐津駅", lat: 33.446223, lng: 129.967587 },
  { name: "西唐津駅", lat: 33.461434, lng: 129.957480 }
];
window.bookstores = [
  { 
    name: "TSUTAYA 九大伊都ラボ", 
    lat: 33.594148,  lng: 130.229617 
  }
];
window.coffeeshops = [
  { 
    name: "Starbucks 九大伊都ラボ", 
    lat: 33.594266,  lng: 130.229810 
  }
];
window.church = [
  { 
    name: "Itoshima Catholic Church", 
    lat: 33.584095,  lng: 130.189016 
  }
];
