window.samples = [
  {
    name: "Johren サンプル・スポット",
    lat: 33.55857973584153,
    lng: 130.21385183358143,
    url: "/merchant/sample/index.html"
  }
];
window.stations = [
  { name: "姪浜駅", lat: 33.58370, lng: 130.32501 },
  { name: "下山門駅", lat: 33.581882, lng: 130.308038 },
  { name: "今宿駅", lat: 33.579257, lng: 130.273519 },
  { name: "九大学研都市駅", lat: 33.578150, lng: 130.259861 },
  { name: "周船寺駅", lat: 33.570792, lng: 130.246136 },
  { name: "波多江駅", lat: 33.563944, lng: 130.226822 },
  { name: "糸島高校前駅", lat: 33.560660, lng: 130.213243 },
  { name: "筑前前原駅", lat: 33.557082, lng: 130.199305 },
  { name: "美咲が丘駅", lat: 33.549959, lng: 130.185515 },
  { name: "加布里駅", lat: 33.543150, lng: 130.176150 },
  { name: "一貴山駅", lat: 33.534295, lng: 130.168242 },
  { name: "筑前深江駅", lat: 33.514949, lng: 130.139429 },
  { name: "大入駅", lat: 33.508855, lng: 130.106038 },
  { name: "福吉駅", lat: 33.501554, lng: 130.079523 },
  { name: "鹿家駅", lat: 33.484259, lng: 130.047476 },
  { name: "浜崎駅", lat: 33.446720, lng: 130.036798 },
  { name: "虹の松原駅", lat: 33.441033, lng: 130.016195 },
  { name: "東唐津駅", lat: 33.439393, lng: 129.996837 },
  { name: "和多田駅", lat: 33.436933, lng: 129.980768 },
  { name: "唐津駅", lat: 33.446223, lng: 129.967587 },
  { name: "西唐津駅", lat: 33.461434, lng: 129.957480 },

// Oita Beppu LINE 
  { name: "大分駅",       lat: 33.23232801877058, lng: 131.6057111319828 },
  { name: "西大分駅",     lat: 33.24522482617123, lng: 131.58285137901504 },
  { name: "東別府駅",     lat: 33.2677076187008,  lng: 131.51050697420135 },
  { name: "別府駅",       lat: 33.27962926018525, lng: 131.50055717746778 },
  { name: "別府大学駅",   lat: 33.31315944403043, lng: 131.49927886577296 },
  { name: "亀川駅",       lat: 33.3312027734460,  lng: 131.493079650432 },

  // KYUDAI MAIN LINE (Ōita → Yufuin)
  { name: "南大分駅",     lat: 33.21406265499788, lng: 131.58629379060434 },
  { name: "古国府駅",     lat: 33.22065690479467, lng: 131.60749091301474 },
  { name: "賀来駅",       lat: 33.21323569734439, lng: 131.5626648657675 },
  { name: "豊後国分駅",   lat: 33.19506346554613, lng: 131.5512154516554 },
  { name: "天神山駅",     lat: 33.186959358136164, lng: 131.43886043693058 },
  { name: "小野屋駅",     lat: 33.18509931488385, lng: 131.4528201313089 },
  { name: "鬼瀬駅",       lat: 33.19563483964115, lng: 131.48543738110843 },
  { name: "南由布駅",     lat: 33.24229580755208, lng: 131.33357602588526 },
  { name: "湯平駅",       lat: 33.1973714290547, lng: 131.35408359460197  },
  { name: "由布院駅",     lat: 33.26269658669704, lng: 131.35526192713755 },
  { name: "牧駅",   lat: 33.23710163129472,  lng: 131.6377864657687 },
  { name: "高城駅",   lat: 33.242651842215196,  lng: 131.6552683657691 },
  { name: "鶴崎駅",   lat: 33.242743773481486,  lng: 131.68689915412372 },
  { name: "大在駅",   lat: 33.24388399586119,  lng: 131.7203999412276 },
  { name: "坂ノ市駅", lat: 33.24229580755208, lng: 131.33357602588526 },
  { name: "幸崎駅",   lat: 33.23665381485215,  lng: 131.75160342343978 },
  { name: "滝尾駅", lat: 33.2093348203975,    lng: 131.6231774657672 },
  { name: "敷戸駅", lat: 33.188145588399905,   lng: 131.61515013693062 },
  { name: "大分大学前駅", lat: 33.17724089366869,  lng: 131.6186053657655 },
  { name: "中判田駅",  lat: 33.16447006646251,  lng: 131.63879511909792 },
  { name: "菅尾駅",    lat: 33.01444709049888,  lng: 131.61642285204695 },
  { name: "竹中駅",     lat: 33.12069695808658,  lng: 131.64940976576244 },
  { name: "犬飼駅",     lat: 33.12069695808658,  lng: 131.64941536040405 },

 // Fukuoka Subway Airport LINE (Airport-Muromi)
  { name: "Airpot 福岡空港駅", lat: 33.59719916364836,  lng: 130.44822439462428  },
  { name: "Higashi-Hie 東比恵駅 Station", lat: 33.589754713543435,   lng: 130.43123418620593 },
  { name: "Hakata 博多駅", lat: 33.589580007114,  lng: 130.42049136024366 },
  { name: "Nakasukawabata Station", lat: 33.594395499429346,   lng: 130.4060595133835 },
  { name: "Tenjin 天神駅", lat: 33.5913469503287,   lng: 130.39891098113026 },
  { name: "Akasaka 赤坂駅",  lat: 33.58906127661953,   lng: 130.3906207746017 },
  { name: "Ohori Park 大濠公園駅", lat: 33.59012812434707,  lng: 130.3788320713684 },
  { name: "Tohjinmachi 唐人町駅", lat: 33.590145613562676,  lng: 130.36996167573926 },
  { name: "Nishijin 西新駅", lat: 33.583574101225004, lng: 130.3592916253071  },
  { name: "Fujisaki 藤崎駅", lat: 33.581378487964386,   lng: 130.34798479092692 },
  { name: "Muromi 室見駅", lat: 33.58091545591748,   lng: 130.33992923325593 }
];

